# St7SetNodeHeatSource1

Sets the heat source at the specified node.

long St7SetNodeHeatSource1(long uID, long NodeNum, long CaseNum, double* Doubles)
Input Parameters
uID
Strand7 model file ID.
NodeNum
Node number.
CaseNum
Load case number.
Doubles[0]
Heat source.